In [49]:
import pandas as pd

In [50]:
# 데이터 프레임 만들기
df = pd.read_csv("health_data.csv")
df

    코드번호 성별    키  체중    BMI  수축기  이완기
0  33001  남  175  65  21.22  143  110
1  34037  여  165  52  19.10  119   78
2  35123  여  159  67  26.50  130   83

In [51]:
# 열 추가
df["성명"] = ["홍길동","유관순","신사임당"]
df

    코드번호 성별    키  체중    BMI  수축기  이완기    성명
0  33001  남  175  65  21.22  143  110   홍길동
1  34037  여  165  52  19.10  119   78   유관순
2  35123  여  159  67  26.50  130   83  신사임당

In [52]:
df.set_index("성명", inplace=True)
df

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
홍길동   33001  남  175  65  21.22  143  110
유관순   34037  여  165  52  19.10  119   78
신사임당  35123  여  159  67  26.50  130   83

In [53]:
df2 = pd.read_csv("health_data.csv")
df2

    코드번호 성별    키  체중    BMI  수축기  이완기
0  33001  남  175  65  21.22  143  110
1  34037  여  165  52  19.10  119   78
2  35123  여  159  67  26.50  130   83

In [54]:
# 열 출가
df2["성명"] = ["이순신","선덕여왕","명성황후"]
df2

    코드번호 성별    키  체중    BMI  수축기  이완기    성명
0  33001  남  175  65  21.22  143  110   이순신
1  34037  여  165  52  19.10  119   78  선덕여왕
2  35123  여  159  67  26.50  130   83  명성황후

In [55]:
df2.set_index("성명",inplace=True)
df2

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
이순신   33001  남  175  65  21.22  143  110
선덕여왕  34037  여  165  52  19.10  119   78
명성황후  35123  여  159  67  26.50  130   83

In [56]:
df3 = df.append(df2)
df3

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
홍길동   33001  남  175  65  21.22  143  110
유관순   34037  여  165  52  19.10  119   78
신사임당  35123  여  159  67  26.50  130   83
이순신   33001  남  175  65  21.22  143  110
선덕여왕  34037  여  165  52  19.10  119   78
명성황후  35123  여  159  67  26.50  130   83

In [57]:
# 데이터 살펴보기 p287
df3.head() # defalut 는 제일 위에서 5개만 보여주기

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
홍길동   33001  남  175  65  21.22  143  110
유관순   34037  여  165  52  19.10  119   78
신사임당  35123  여  159  67  26.50  130   83
이순신   33001  남  175  65  21.22  143  110
선덕여왕  34037  여  165  52  19.10  119   78

In [58]:
df3.tail() # defalut는 제일 밑에서 5개만 보여주기

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
유관순   34037  여  165  52  19.10  119   78
신사임당  35123  여  159  67  26.50  130   83
이순신   33001  남  175  65  21.22  143  110
선덕여왕  34037  여  165  52  19.10  119   78
명성황후  35123  여  159  67  26.50  130   83

In [59]:
df3.head(3)

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
홍길동   33001  남  175  65  21.22  143  110
유관순   34037  여  165  52  19.10  119   78
신사임당  35123  여  159  67  26.50  130   83

In [60]:
df3.tail(3)

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
이순신   33001  남  175  65  21.22  143  110
선덕여왕  34037  여  165  52  19.10  119   78
명성황후  35123  여  159  67  26.50  130   83

In [61]:
# 데이터 요약 정보 p289
# 데이터 프레임 크기
print("형과 열의 크기에 대한 정보")
print(df3.shape)
df3

형과 열의 크기에 대한 정보
(6, 7)

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
홍길동   33001  남  175  65  21.22  143  110
유관순   34037  여  165  52  19.10  119   78
신사임당  35123  여  159  67  26.50  130   83
이순신   33001  남  175  65  21.22  143  110
선덕여왕  34037  여  165  52  19.10  119   78
명성황후  35123  여  159  67  26.50  130   83

In [62]:
# 기본 정보 확인 p290
df3.info() # pandas에서는 string을 object로

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 홍길동 to 명성황후
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   코드번호    6 non-null      int64
 1   성별      6 non-null      object
 2   키       6 non-null      int64
 3   체중      6 non-null      int64
 4   BMI     6 non-null      float64
 5   수축기     6 non-null      int64
 6   이완기     6 non-null      int64
dtypes: float64(1), int64(5), object(1)
memory usage: 384.0+ bytes

In [63]:
# 특정 열에 대한 자료형 정보 확인 p291
print("df.성별.dtype =")
print(df.성별.dtype)

print("df.BMI.dtype =")
print(df.BMI.dtype)

print("df.키.dtype =")
print(df.키.dtype)

df.성별.dtype =
object
df.BMI.dtype =
float64
df.키.dtype =
int64

In [64]:
# 기술 통계 정보 p294
# count : 열 개수
# mean : 평균값, min : 최솟값, max : 최대값
# std : 표준편차(평큔에 대한 오차
# -> 평균으로부터 원래 데이터에 대한 오차범위의 근사값.)
# 데이터프레임에서 산술 데이터에 대한 기술 통계 정보
df3.describe()

               코드번호           키         체중        BMI         수축기         이완기
count      6.000000    6.000000   6.000000   6.000000    6.000000    6.000000
mean   34053.666667  166.333333  61.333333  22.273333  130.666667   90.333333
std      949.075058    7.229569   7.284687   3.408476   10.745542   15.396969
min    33001.000000  159.000000  52.000000  19.100000  119.000000   78.000000
25%    33260.000000  160.500000  55.250000  19.630000  121.750000   79.250000
50%    34037.000000  165.000000  65.000000  21.220000  130.000000   83.000000
75%    34851.500000  172.500000  66.500000  25.180000  139.750000  103.250000
max    35123.000000  175.000000  67.000000  26.500000  143.000000  110.000000

In [65]:
df3

       코드번호 성별    키  체중    BMI  수축기  이완기
성명
홍길동   33001  남  175  65  21.22  143  110
유관순   34037  여  165  52  19.10  119   78
신사임당  35123  여  159  67  26.50  130   83
이순신   33001  남  175  65  21.22  143  110
선덕여왕  34037  여  165  52  19.10  119   78
명성황후  35123  여  159  67  26.50  130   83

In [66]:
# 열에 대한 정보를 포함한 데이터프레임의 기술 통계 정보 p296
# unique : 열에 대한 고유값 개수 , top : 관찰된 최대도수를 갖는 데이터
# freq : 같은 열의 값이 반복되는 도수
df3.describe(include='all')

,코드번호,성별,키,체중,BMI,수축기,이완기
count,6.000000,6,6.000000,6.000000,6.000000,6.000000,6.000000
unique,NaN,2,NaN,NaN,NaN,NaN,NaN
top,NaN,여,NaN,NaN,NaN,NaN,NaN
freq,NaN,4,NaN,NaN,NaN,NaN,NaN
mean,34053.666667,NaN,166.333333,61.333333,22.273333,130.666667,90.333333
std,949.075058,NaN,7.229569,7.284687,3.408476,10.745542,15.396969
min,33001.000000,NaN,159.000000,52.000000,19.100000,119.000000,78.000000
25%,33260.000000,NaN,160.500000,55.250000,19.630000,121.750000,79.250000
50%,34037.000000,NaN,165.000000,65.000000,21.220000,130.000000,83.000000
75%,34851.500000,NaN,172.500000,66.500000,25.180000,139.750000,103.250000
max,35123.000000,NaN,175.000000,67.000000,26.500000,143.000000,110.000000

In [67]:
# 데이터의 개수 확인 p298
# 각 열의 데이터 개수 확인
df3.count()

코드번호    6
성별      6
키       6
체중      6
BMI     6
수축기     6
이완기     6
dtype: int64

In [68]:
# 각각의 열의 고유값 개수 확인 p299
df3["성별"].value_counts()

여    4
남    2
Name: 성별, dtype: int64

In [69]:
# 통계 함수
# 평균값
df3.mean()

C:\Users\도연\AppData\Local\Temp/ipykernel_8416/3756417417.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.mean()

코드번호    34053.666667
키         166.333333
체중         61.333333
BMI        22.273333
수축기       130.666667
이완기        90.333333
dtype: float64

In [70]:
df3["BMI"].mean()

22.27333333333333

In [71]:
df3[["키","체중"]].mean()

키     166.333333
체중     61.333333
dtype: float64

In [74]:
df3.loc[:,"키":"이완기"].mean()

키      166.333333
체중      61.333333
BMI     22.273333
수축기    130.666667
이완기     90.333333
dtype: float64

In [75]:
# 상관계수 p311
# 산점도에서 점들이 얼마나 직선에 가까운가의 정도를 나타내는데 쓰이는 척도
# 1에 가까울수록 양의 상관관게가 강하고
# -1에 가까울수록 음의 상관관계가 강함
# 0일 때는 관계가 없음을 나타냄
df3.corr()

          코드번호         키        체중       BMI       수축기       이완기
코드번호  1.000000 -0.987709  0.136270  0.702515 -0.529551 -0.775718
키    -0.987709  1.000000  0.020254 -0.582641  0.655634  0.864825
체중    0.136270  0.020254  1.000000  0.800762  0.768203  0.519486
BMI   0.702515 -0.582641  0.800762  1.000000  0.231676 -0.095833
수축기  -0.529551  0.655634  0.768203  0.231676  1.000000  0.946114
이완기  -0.775718  0.864825  0.519486 -0.095833  0.946114  1.000000

In [76]:
df3[["키","체중"]].corr()

           키        체중
키   1.000000  0.020254
체중  0.020254  1.000000